; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v9 ?v10)
             (pred_12 ?v12 ?v8)
             (pred_9 ?v9 ?v8)
             (pred_2 ?v5 ?v9 )
	     (pred_5 ?v9)
             (pred_10 ?v6)
             (pred_1 ?v12)
             (pred_11 ?v8)
             (pred_4 ?v9)
             (pred_3 ?v12)
             (pred_8 ?v9)
             (pred_7 ))



(:action op_1
:parameters (?v2 ?v3 ?v4 ?v1)
:precondition (and (pred_10 ?v2) (pred_10 ?v3) (pred_1 ?v4) (pred_11 ?v1)
          (pred_6 ?v2 ?v3) (pred_12 ?v4 ?v1)
                   (pred_9 ?v3 ?v1) (pred_5 ?v2) 
                   (pred_4 ?v3) (pred_3 ?v4))
:effect (and  (pred_8 ?v3) (not (pred_4 ?v3))))


(:action op_2
:parameters (?v2 ?v7)
:precondition (and (pred_10 ?v2) (pred_10 ?v7)
               (pred_5 ?v2) (pred_6 ?v2 ?v7) (pred_8 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v2))))

(:action op_3
:parameters (?v2 ?v4)
:precondition (and (pred_10 ?v2) (pred_1 ?v4) 
                  (pred_5 ?v2) (pred_2 ?v4 ?v2) (pred_7 ))
:effect (and (pred_3 ?v4)
   (not (pred_2 ?v4 ?v2)) (not (pred_7 ))))


(:action op_5
:parameters (?v2 ?v11 ?v13)
:precondition (and (pred_10 ?v2) (pred_1 ?v11) (pred_1 ?v13)
                  (pred_5 ?v2) (pred_3 ?v13) (pred_2 ?v11 ?v2))
:effect (and (pred_3 ?v11) (pred_2 ?v13 ?v2)
        (not (pred_3 ?v13)) (not (pred_2 ?v11 ?v2))))

(:action op_4
:parameters (?v2 ?v4)
:precondition (and (pred_10 ?v2) (pred_1 ?v4) 
                  (pred_5 ?v2) (pred_3 ?v4))
:effect (and (pred_7 ) (pred_2 ?v4 ?v2) (not (pred_3 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_08 obj_05 obj_16 obj_18 obj_12 obj_03 obj_02 obj_04 obj_14 obj_11 obj_06 obj_10 obj_19 obj_17 obj_15
    obj_20 obj_01
    obj_09 obj_07 obj_21
    )

    (:init
       (pred_7)

       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_16)
       (pred_10 obj_18)
       (pred_10 obj_12)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_14)
       (pred_10 obj_11)
       (pred_10 obj_06)
       (pred_10 obj_10)
       (pred_10 obj_19)
       (pred_10 obj_17)
       (pred_10 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_01)
       (pred_1 obj_09)
       (pred_1 obj_07)
       (pred_1 obj_21)

       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_13)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_16)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_16 obj_05)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_12 obj_14)
       (pred_6 obj_12 obj_03)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_16)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_04 obj_10)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_14 obj_12)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_10 obj_04)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_17)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_14)
       (pred_9  obj_15 obj_20)
       (pred_9  obj_05 obj_01)
       (pred_9  obj_14 obj_01)
       (pred_8 obj_13)
       (pred_8 obj_08)
       (pred_8 obj_16)
       (pred_8 obj_18)
       (pred_8 obj_12)
       (pred_8 obj_03)
       (pred_8 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_11)
       (pred_8 obj_06)
       (pred_8 obj_10)
       (pred_8 obj_19)
       (pred_8 obj_17)

       (pred_12  obj_09 obj_20)
       (pred_12  obj_07 obj_01)
       (pred_12  obj_21 obj_01)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_07 obj_19)
       (pred_2 obj_21 obj_12)
       (pred_5 obj_03)
    )

    (:goal (and
       (pred_2 obj_09 obj_17)
       (pred_2 obj_21 obj_17)
    ))
(:constraints
  (always (not (pred_5 obj_08)))
)
)

; plan
1. (op_2 obj_03 obj_12)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_12)
   goals met: 0 of 2
2. (op_2 obj_12 obj_18)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_18)
   goals met: 0 of 2
3. (op_2 obj_18 obj_13)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_13)
   goals met: 0 of 2
4. (op_3 obj_13 obj_09)
   deleted: (pred_2 obj_09 obj_13) (pred_7)
   added: (pred_3 obj_09)
   goals met: 0 of 2
5. (op_2 obj_13 obj_18)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_18)
   goals met: 0 of 2
6. (op_2 obj_18 obj_12)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_12)
   goals met: 0 of 2
7. (op_2 obj_12 obj_03)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_03)
   goals met: 0 of 2
8. (op_2 obj_03 obj_11)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_11)
   goals met: 0 of 2
9. (op_2 obj_11 obj_17)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_17)
   goals met: 0 of 2
10. (op_4 obj_17 obj_09)
   deleted: (pred_3 obj_09)
   added: (pred_7) (pred_2 obj_09 obj_17)
   goals met: 1 of 2
11. (op_2 obj_17 obj_11)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_11)
   goals met: 1 of 2
12. (op_2 obj_11 obj_03)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_03)
   goals met: 1 of 2
13. (op_2 obj_03 obj_12)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_12)
   goals met: 1 of 2
14. (op_3 obj_12 obj_21)
   deleted: (pred_2 obj_21 obj_12) (pred_7)
   added: (pred_3 obj_21)
   goals met: 1 of 2
15. (op_2 obj_12 obj_03)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_03)
   goals met: 1 of 2
16. (op_2 obj_03 obj_11)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_11)
   goals met: 1 of 2
17. (op_2 obj_11 obj_17)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_17)
   goals met: 1 of 2
18. (op_4 obj_17 obj_21)
   deleted: (pred_3 obj_21)
   added: (pred_7) (pred_2 obj_21 obj_17)
   goals met: 2 of 2
